package com.guihe.platform.core.enmus;

public enum ErrorCodeEnum {
    /**
     * Gl 99990100 error code enum.
     */
    GL99990100(9999100, "参数异常"),
    /**
     * Gl 99990401 error code enum.
     */
    GL99990401(99990401, "无访问权限"),
    /**
     * Gl 000500 error code enum.
     */
    GL99990500(500, "未知异常"),
    /**
     * Gl 000403 error code enum.
     */
    GL99990403(9999403, "无权访问"),
    /**
     * Gl 000404 error code enum.
     */
    GL9999404(9999404, "找不到指定资源"),
    /**
     * Gl 99990001 error code enum.
     */
    GL99990001(99990001, "注解使用错误"),
    /**
     * Gl 99990002 error code enum.
     */
    GL99990002(99990002, "微服务不在线,或者网络超时"),

    GL99990003(99990003, "该账户未绑定手机号"),
    /**
     * Uac 10010001 error code enum.
     */
    // 1001 用户中心
    UAC10010001(10010001, "会话超时,请刷新页面重试"),
    /**
     * Uac 10010002 error code enum.
     */
    UAC10010002(10010002, "TOKEN解析失败"),
    /**
     * Uac 10010003 error code enum.
     */
    UAC10010003(10010003, "操作频率过快, 您的帐号已被冻结"),
    /**
     * Uac 10011001 error code enum.
     */
    UAC10011001(10011001, "用户Id不能为空"),
    /**
     * Uac 10011002 error code enum.
     */
    UAC10011002(10011002, "找不到用户,loginName=%s"),
    /**
     * Uac 10011003 error code enum.
     */
    UAC10011003(10011003, "找不到用户,userId=%s"),
    /**
     * Uac 10011004 error code enum.
     */
    UAC10011004(10011004, "找不到用户,email=%s"),
    /**
     * Uac 10011006 error code enum.
     */
    UAC10011006(10012006, "手机号不能为空"),
    /**
     * Uac 10011007 error code enum.
     */
    UAC10011007(10011007, "登录名不能为空"),
    /**
     * Uac 10011008 error code enum.
     */
    UAC10011008(10011008, "新密码不能为空"),
    /**
     * Uac 10011009 error code enum.
     */
    UAC10011009(10011009, "确认密码不能为空"),
    /**
     * Uac 10011010 error code enum.
     */
    UAC10011010(10011010, "两次密码不一致"),
    /**
     * Uac 10011011 error code enum.
     */
    UAC10011011(10011011, "用户不存在, userId=%s"),
    /**
     * Uac 10011012 error code enum.
     */
    UAC10011012(10011012, "登录名已存在"),
    /**
     * Uac 10011013 error code enum.
     */
    UAC10011013(10011013, "手机号已存在"),
    /**
     * Uac 10011014 error code enum.
     */
    UAC10011014(10011014, "密码不能为空"),
    /**
     * Uac 10011016 error code enum.
     */
    UAC10011016(10011016, "用户名或密码错误"),
    /**
     * Uac 10011017 error code enum.
     */
    UAC10011017(10011017, "验证类型错误"),
    /**
     * Uac 10011018 error code enum.
     */
    UAC10011018(10011018, "邮箱不能为空"),
    /**
     * Uac 10011019 error code enum.
     */
    UAC10011019(10011019, "邮箱已存在"),
    /**
     * Uac 10011020 error code enum.
     */
    UAC10011020(10011020, "短信模板不能为空"),
    /**
     * Uac 10011021 error code enum.
     */
    UAC10011021(10011021, "发送短信验证码对象转换为json字符串失败"),
    /**
     * Uac 10011022 error code enum.
     */
    UAC10011022(10011022, "发送短信验证码失败"),
    /**
     * Uac 10011023 error code enum.
     */
    UAC10011023(10011023, "越权操作"),
    /**
     * Uac 10011024 error code enum.
     */
    UAC10011024(10011024, "找不到绑定的用户, userId=%s"),
    /**
     * Uac 10011025 error code enum.
     */
    UAC10011025(10011025, "用户已存在, loginName=%s"),
    /**
     * Uac 10011026 error code enum.
     */
    UAC10011026(10011026, "更新用户失败, userId=s%"),
    /**
     * Uac 10011027 error code enum.
     */
    UAC10011027(10011027, "找不到用户,mobile=%s"),
    /**
     * Uac 10011028 error code enum.
     */
    UAC10011028(10011028, "链接已失效"),
    /**
     * Uac 10011029 error code enum.
     */
    UAC10011029(10011029, "重置密码失败"),
    /**
     * Uac 10011030 error code enum.
     */
    UAC10011030(10011030, "激活失败, 链接已过期"),
    /**
     * Uac 10011031 error code enum.
     */
    UAC10011031(10011031, "验证码超时, 请重新发送验证码"),
    /**
     * Uac 10011032 error code enum.
     */
    UAC10011032(10011032, "邮箱不存在, loginName=%s,email=%s"),
    /**
     * Uac 10011033 error code enum.
     */
    UAC10011033(10011033, "清空该用户常用菜单失败"),
    /**
     * Uac 10011034 error code enum.
     */
    UAC10011034(10011034, "不允许操作admin用户"),
    /**
     * Uac 10011035 error code enum.
     */
    UAC10011035(10011035, "原始密码输入错误"),
    /**
     * Uac 10011036 error code enum.
     */
    UAC10011036(10011036, "新密码和原始密码不能相同"),
    /**
     * Uac 10011037 error code enum.
     */
    UAC10011037(10011037, "修改用户失败,userId=%s"),
    /**
     * Uac 10011038 error code enum.
     */
    UAC10011038(10011038, "激活用户失败,userId=%s"),
    /**
     * Uac 10011039 error code enum.
     */
    UAC10011039(10011039, "验证token失败"),
    /**
     * Uac 10011040 error code enum.
     */
    UAC10011040(10011040, "解析header失败"),
    /**
     * Uac 10011041 error code enum.
     */
    UAC10011041(10011041, "页面已过期,请重新登录"),
    /**
     * Uac 10011042 error code enum.
     */
    UAC10011042(10011042, "Cookie转码异常"),
    /**
     * Uac 10012001 error code enum.
     */
    UAC10012001(10012001, "角色ID不能为空"),
    /**
     * Uac 10012002 error code enum.
     */
    UAC10012002(10012002, "拥有的角色不允许禁用"),
    /**
     * Uac 10012003 error code enum.
     */
    UAC10012003(10012003, "系统角色不能删除"),
    /**
     * Uac 10012004 error code enum.
     */
    UAC10012004(10012004, "超级角色Id不能为空"),

    /**
     * Uac 10012005 error code enum.
     */
    UAC10012005(10012005, "找不到角色信息,roleId=%s"),
    /**
     * Uac 10012006 error code enum.
     */
    UAC10012006(10012006, "删除角色失败, roleId=%s"),
    /**
     * Uac 10012007 error code enum.
     */
    UAC10012007(10012007, "批量删除角色失败, roleId=%s"),
    /**
     * Uac 10012008 error code enum.
     */
    UAC10012008(10012008, "找不到绑定的角色, roleId=%s"),

    /**
     * Uac 10013001 error code enum.
     */
    UAC10013001(10013001, "父菜单不存在,menuId=%s"),
    /**
     * Uac 10013002 error code enum.
     */
    UAC10013002(10013002, "更新上级菜单失败,menuId=%s"),
    /**
     * Uac 10013003 error code enum.
     */
    UAC10013003(10013003, "菜单不存在,menuId=%s"),
    /**
     * Uac 10013004 error code enum.
     */
    UAC10013004(10013004, "启用菜单失败,menuId=%s"),
    /**
     * Uac 10013005 error code enum.
     */
    UAC10013005(10013005, "禁用菜单失败,menuId=%s"),
    /**
     * Uac 10013006 error code enum.
     */
    UAC10013006(10013006, "更新菜单状态失败,menuId=%s"),
    /**
     * Uac 10013007 error code enum.
     */
    UAC10013007(10013007, "根菜单不能禁用"),
    /**
     * Uac 10013008 error code enum.
     */
    UAC10013008(10013008, "删除菜单失败, menuId=%s"),
    /**
     * Uac 10013009 error code enum.
     */
    UAC10013009(10013009, "请先分配菜单"),
    /**
     * Uac 10013010 error code enum.
     */
    UAC10013010(10013010, "选择菜单不是根目录,menuId=%s"),

    /**
     * Uac 10014001 error code enum.
     */
    UAC10014001(10014001, "找不到权限信息, actionId=%s"),
    /**
     * Uac 10014002 error code enum.
     */
    UAC10014002(10014002, "删除失败, actionId=%s"),
    /**
     * Uac 10014003 error code enum.
     */
    UAC10014003(10014003, "保存权限信息失败"),
    /**
     * Uac 10015001 error code enum.
     */
    UAC10015001(10015001, "找不到组织信息,groupId=%s"),
    /**
     * Uac 10015002 error code enum.
     */
    UAC10015002(10015002, "组织状态不存在"),
    /**
     * Uac 10015003 error code enum.
     */
    UAC10015003(10015003, "操作越权, 启用子节点, 必须先启用父节点"),
    /**
     * Uac 10015004 error code enum.
     */
    UAC10015004(10015004, "找不到组织信息,groupId=%s"),
    /**
     * Uac 10015006 error code enum.
     */
    UAC10015006(10015006, "更新组织信息失败,groupId=%s"),
    /**
     * Uac 10015007 error code enum.
     */
    UAC10015007(10015007, "该组织下还存在子节点，不能将其删除, Pid=%s"),
    /**
     * Uac 10015008 error code enum.
     */
    UAC10015008(10015008, "该组织下绑定的用户，不能将其删除, groupId=%s"),
    /**
     * Uac 10015009 error code enum.
     */
    UAC10015009(10015009, "找不到上级组织, groupId=%s"),
    UAC10015010(10015010, "更新消息失败, informationId=%"),

    UAC10015011(10015011, "消息ID不能为空"),
    UAC10015012(10015012, "删除已确认和用户的关联关系失败"),
    UAC10015013(10015013, "查询统计信息失败，userId=%s"),
    UAC10015014(10015014, "保存用户信息失败"),
    UAC10015015(10015015, "该手机号已经绑定过用户，mobile=%s"),
    UAC10015016(10015016, "用户实名认证的姓名不能为空"),
    UAC10015017(10015017, "用户实名认证的身份证号不能为空"),
    UAC10015018(10015018, "用户实名认证失败，请重试，userId=%s"),
    UAC10015019(10015019, "一个用户只能实名认证一个信息，请先注销，userId=%s"),

    UAC10015020(10015020, "该手机号和系统绑定的手机号不一致，mobile=%s"),

    UAC10015021(10015021, "该姓名和系统的不一致，accountName=%s"),
    UAC10015022(10015022, "账号绑定失败"),
    UAC10015023(10015023, "绑定账号的店铺ID和当前用户不一致，shopId=%s"),
    UAC10015024(10015024, "只能绑定一个该类型的账号，accountType=%s"),
    UAC10015025(10015025, "要解绑的账号系统不存在，id=%s"),
    UAC10015026(10015026, "解绑账号失败，id=%s"),
    UAC10015027(10015027, "密码只能是6位数字"),
    UAC10015028(10015028, "设置密码失败"),

    UAC10015029(10015029, "信息错误"),
    UAC10015030(10015030, "提现入库失败"),

    UAC10015031(10015031, "微信提现失败"),

    UAC10015032(10015032, "密码不正确"),

    UAC10015033(10015033, "修改支付密码失败"),

    UAC10015034(10015034, "已经设置过支付密码"),

    UAC10015035(10015035, "登录名已经存在"),

    UAC10015036(10015036, "用户未绑定支付账号"),

    UAC10015037(10015037, "你还未关注此用户，id=%s"),

    UAC10015038(10015038, "你已关注此用户，id=%s"),

    UAC10015039(10015039, "用户不存在，id=%s"),

    UAC10015040(10015040, "账户余额不够"),

    UAC10015041(10015041, "更新投诉失败"),

    UAC10015042(10015042, "更新卡券失败"),

    UAC10015043(10015043, "删除卡券失败"),

    UAC10015044(10015044, "更新卡券用户表失败"),

    UAC10015045(10015045, "删除卡券用户表失败"),
    UAC10015046(10015046, "查询卡券用户表失败"),
    UAC10015047(10015047, "查询卡券表失败"),

    UAC10015048(10015048, "用户的账户信息不存在"),

    UAC10015049(10015049, "查询红娘账户信息失败"),

    UAC10015050(10015050, "账户余额不足"),

    UAC10015051(10015051, "更新意见反馈失败"),

    UAC10015052(10015052, "删除意见反馈失败"),

    UAC10015053(10015053, "更新VIP卡失败"),

    UAC10015054(10015054, "删除VIP卡失败"),

    UAC10015055(10015055, "会员卡ID不能为空"),

    UAC10015056(10015056, "会员卡不存在，id=%s"),

    UAC10015057(10015057, "找不到绑定的特权, id=%s"),

    UAC10015058(10015058, "无效的会员卡类型"),

    UAC10015059(10015059, "删除会员卡失败"),

    UAC10015060(10015060, "创建会员卡失败"),

    UAC10015061(10015061, "更新红娘打赏失败"),

    UAC10015062(10015062, "删除红娘打赏失败"),

    UAC10015063(10015063, "该用户的推广码已经存在, id=%s"),

    UAC10015064(10015064, "保存二维码失败"),

    UAC10015065(10015065, "该用户不存在推广码, id=%s"),

    UAC10015066(10015066, "更新推广信息失败"),

    UAC10015067(10015067, "您无权调该接口"),

    UAC10015068(10015068, "更新兑换规则失败"),

    UAC10015069(10015069, "删除兑换规则失败"),
    UAC10015070(10015070, "该兑换规则不存在"),
    UAC10015071(10015071, "更新会员卡失败"),


    /**
     * 1002开始是DMC的错误码
     */
    DMC10020001(10020001, "根据IP定位失败"),
    /**
     * DMC10020002 error code enum.
     */
    DMC10020002(10020002, "上传文件失败"),
    /**
     * DMC10020003 error code enum.
     */
    DMC10020003(10020003, "文件类型不符"),
    /**
     * DMC10020004 error code enum.
     */
    DMC10020004(10020004, "发送短信失败"),
    /**
     * DMC10020005 error code enum.
     */
    DMC10020005(10020005, "生成邮件消息体失败"),
    /**
     * DMC10020006 error code enum.
     */
    DMC10020006(10020006, "获取模板信息失败"),
    /**
     * DMC10020007 error code enum.
     */
    DMC10020007(10020007, "更新附件失败, id=%s"),
    /**
     * DMC10020008 error code enum.
     */
    DMC10020008(10020008, "找不到该附件信息, id=%s"),
    /**
     * DMC10020009 error code enum.
     */
    DMC10020009(10020009, "上传图片失败"),
    /**
     * DMC10020010 error code enum.
     */
    DMC10020010(10020010, "文件名不能为空"),
    /**
     * DMC10020011 error code enum.
     */
    DMC10020011(10020011, "今日流量已用尽, 请明天再试"),
    /**
     * DMC10020012 error code enum.
     */
    DMC10020012(10020012, "目标文件已不存在，请核实"),
    /**
     * DMC10020013 error code enum.
     */
    DMC10020013(10020013, "删除文件失败"),
    /**
     * DMC10020014 error code enum.
     */
    DMC10020014(10020014, "文件下载失败"),

    DMC10020015(10020015, "上传社交圈的banner到阿里云失败"),

    DMC10020016(10020016, "删除阿里云上的banner失败"),
    DMC10020017(10020017, "上传图片到阿里云失败"),
    DMC10020018(10020018, "查询不到该信息"),
    DMC10020019(10020019, "获取banner失败"),
    DMC10020020(10020020, "快递鸟后去请求参数失败"),

    /**
     * 1003开始是DPC的错误码
     */
    DPC10031001(10031001, "更新单身基本信息失败"),

    DPC10031002(10031002, "更新单身择偶标准信息失败"),

    DPC10031003(10031003, "更新单身详细准信息失败"),

    DPC10031004(10031004, "更新单身保密准信息失败"),

    DPC10031005(10031005, "您无权查询该数据"),
    DPC10031006(10031006, "更新红娘信息失败"),
    DPC10031007(10031007, "更新备注信息失败"),
    DPC10031008(10031008, "更新工作日志信息失败"),
    DPC10031009(10031009, "当前用户还未完善自己的红娘信息，请先创建红娘信息"),
    DPC10031010(10031010, "今日的鲜花已经送完"),
    DPC10031011(10031011, "请求已发出"),
    DPC10031012(10031012, "您无权查看"),
    DPC10031013(10031013, "您已经发送了专业红娘申请。"),
    DPC10031014(10031014, "更新实名认证信息失败"),
    DPC10031015(10031015, "更新单身认证信息失败"),

    DPC10031016(10031016, "您无权查看该单身的相关工作日志"),

    DPC10031017(10031017, "该单身没有认证信息，id=%s"),

    DPC10031018(10031018, "请求不存在，id=%s"),

    DPC10031019(10031019, "您无权更改该数据"),

    DPC10031020(10031020, "您的爱情豆数量不足，请及时兑换爱情豆"),

    DPC10031021(10031021, "该单身不存在，id=%s"),

    /**
     * 1004开始是emc的错误码
     */
    EMC10041001(10041001, "评价中心错误"),

    EMC10041002(10041002, "获取B的评价信息失败"),

    EMC10041003(10041003, "根据查询条件没有获取到任何评价信息"),
    EMC10041004(10041004, "自动更新评价失败"),
    EMC10041005(10041005, "删除评价信息失败"),


    /**
     * 1005
     */
    TMC10050001(10050001, "消息的消费Topic不能为空"),
    /**
     * TMC 10050002 error code enum.
     */
    TMC10050002(10050002, "根据消息key查找的消息为空"),
    /**
     * TMC 10050003 error code enum.
     */
    TMC10050003(10050003, "删除消息失败,messageKey=%s"),
    /**
     * TMC 10050004 error code enum.
     */
    TMC10050004(10050004, "消息中心接口异常,message=%s, messageKey=%s"),
    /**
     * TMC 10050005 error code enum.
     */
    TMC10050005(10050005, "目标接口参数不能为空"),
    /**
     * TMC 10050006 error code enum.
     */
    TMC10050006(10050006, "根据任务Id查找的消息为空"),

    /**
     * TMC 10050007 error code enum.
     */
    TMC10050007(10050007, "消息数据不能为空"),
    /**
     * TMC 10050008 error code enum.
     */
    TMC10050008(10050008, "消息体不能为空,messageKey=%s"),
    /**
     * TMC 10050009 error code enum.
     */
    TMC10050009(10050009, "消息KEY不能为空"),

    /**
     * TMC 100500010 error code enum.
     */
    TMC100500010(10050010, "Topic=%s, 无消费者订阅"),
    /**
     * TMC 100500011 error code enum.
     */
    TMC100500011(10050011, "Mq编码转换异常, MessageKey=%s"),
    /**
     * TMC 100500012 error code enum.
     */
    TMC100500012(10050012, "发送MQ失败, MessageKey=%s"),
    /**
     * TMC 100500013 error code enum.
     */
    TMC100500013(10050013, "延迟级别错误, Topic=%s, MessageKey=%s"),
    /**
     * TMC 100500014 error code enum.
     */
    TMC100500014(10050014, "MQ重试三次,仍然发送失败, Topic=%s, MessageKey=%s"),
    /**
     * TMC 100500015 error code enum.
     */
    TMC100500015(10050015, "消息PID不能为空, messageKey=%s"),

    /**
     * 1006开始是OMC的错误码
     */
    OMC10061001(10061001, "您的咨询已经发出。请耐心等待答复"),
    OMC10061002(10061002, "保存咨询信息失败"),
    OMC10061003(10061003, "不存在默认地址"),
    OMC10061004(10061004, "更新默认地址失败, addressId=%s"),
    OMC10061009(10061009, "找不到订单详情信息, orderNo=%s"),

    OMC10061010(10061010, "发送短信验证码失败"),
    /**
     * Omc 10061011 error code enum.
     */
    OMC10061011(10061011, "该订单已付款"),
    OMC10061012(10061012, "更新服务套餐卡失败"),
    OMC10061013(10061013, "删除服务套餐卡失败"),
    OMC10061014(10061014, "查询服务套餐卡失败"),
    OMC10061015(10061015, "查询红娘失败"),
    OMC10061016(10061016, "查询单身失败"),
    OMC10061017(10061017, "要取消的订单不存在, 订单号=%s"),
    OMC10061018(10061018, "更新订单失败, 订单号=%s"),
    OMC10061019(10061019, "支付订单失败, 订单号=%s"),
    OMC10061020(10061020, "已经为用户选过了套餐，用户ID=%s"),


    /**
     * 1007开始是PMC的错误码
     */
    PMC10071001(10071001, "支付中心错误"),
    PMC10071002(10071002, "未知的支付来源"),
    PMC10071003(10071003, "退款失败"),
    PMC10071004(10071004, "查询支付宝的支付信息失败"),
    PMC10071005(10071005, "退款失败"),
    PMC10071006(10071006, "查询对账单失败"),
    PMC10071007(10071007, "该值不正确 "),

    /**
     * 1008开始是CPC的错误码
     */
    CPC10081001(10081001, "修改模板信息失败"),
    CPC10081002(10081002, "参数转换失败"),
    CPC10081003(10081003, "该规则在数据库中不存在"),
    CPC10081004(10081004, "该模板在数据库中不存在"),
    CPC10081005(10081005, "获取活动失败"),
    CPC10081006(10081006, "更新法律咨询失败"),
    CPC10081007(10081007, "删除法律咨询失败"),
    CPC10081008(10081008, "更新婚恋课堂失败"),
    CPC10081009(10081009, "删除婚恋课堂失败"),
    CPC10081010(10081010, "更新相关服务失败"),
    CPC10081011(10081011, "删除相关服务失败"),
    CPC10081012(10081012, "更新情感专家失败"),
    CPC10081013(10081013, "删除情感专家失败"),
    CPC10081014(10081014, "更新活动失败"),
    CPC10081015(10081015, "删除活动失败"),
    CPC10081016(10081016, "您已报名。不需要再报名"),
    CPC10081017(10081017, "增加报名失败"),
    CPC10081018(10081018, "您还没有进行单身认证和实名认证，无法报名哦"),
    CPC10081019(10081019, "发送短信失败"),


    /**
     * 1009开始是cdc的错误码
     */
    CDC10091001(10091001, "查询进店信息失败"),
    CDC10091002(10091002, "查询观看视频信息失败"),
    CDC10091003(10091003, "查询店铺搜索信息失败"),
    CDC10091004(10091004, "查询关注、取消关注店铺信息失败"),
    CDC10091005(10091005, "查询用户和视频id的行为信息失败"),

    /**
     * 1010开始是crc的错误码
     */
    CRC10101001(10101001, "更新课堂失败, courseId=s%\""),
    CRC10101002(10101002, "更新动态失败, activitiesId=s%\""),


    ;
    private int code;

    private String msg;

    public String msg() {
        return msg;
    }

    public int code() {
        return code;
    }

    ErrorCodeEnum(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public static ErrorCodeEnum getEnum(int code) {
        for (ErrorCodeEnum errorCodeEnum : values()) {
            if (errorCodeEnum.code == code) {
                return errorCodeEnum;
            }
        }
        return null;
    }
}
